INSERT INTO public.materialstype (title,perofdefects) VALUES
	 ('Тип материала 1',0.1),
	 ('Тип материала 2',0.95),
	 ('Тип материала 3',0.28),
	 ('Тип материала 4',0.55),
	 ('Тип материала 5',0.34);
INSERT INTO public.partners (partnerstypeid,title,legaladdress,inn,head,phonenumber,email,logo,rating) VALUES
	 (2,'Паркет 29','164500, Архангельская область, город Северодвинск, ул. Строителей, 18','3333888520','Петров Василий Петрович','987 123 56 78','vppetrov@vl.ru','',7),
	 (3,'Стройсервис','188910, Ленинградская область, город Приморск, ул. Парковая, 21','4440391035','Соловьев Андрей Николаевич','812 223 32 00','ansolovev@st.ru','',7),
	 (4,'Ремонт и отделка','143960, Московская область, город Реутов, ул. Свободы, 51','1111520857','Воробьева Екатерина Валерьевна','444 222 33 11','ekaterina.vorobeva@ml.ru','',5),
	 (1,'МонтажПро','309500, Белгородская область, город Старый Оскол, ул. Рабочая, 122','5552431140','Степанов Степан Сергеевич','912 888 33 33','stepanov@stepan.ru','',10),
	 (3,'Ромашка','353340, Тульская область, город Балашиха, ул. Будапештсткая, 65','2811022383','Цветков Даниил Филиппович','783 133 21 79','ruxaddissedu-2686@yopmail.com',NULL,9),
	 (2,'База Строитель','652050, Кемеровская область, город Юрга, ул. Лесная, 15','2222455179','Иванова Александра Ивановна','493 123 45 67','aleksandraivanova@ml.ru','',7),
	 (1,'123','12','1','1','1','1',NULL,1);
INSERT INTO public.partnersproducts (productsid,partnersid,numberofproducts,saledate) VALUES
	 (1,1,15500,'2023-03-23'),
	 (3,1,12350,'2023-12-18'),
	 (4,1,37400,'2024-06-07'),
	 (2,2,35000,'2022-12-02'),
	 (5,2,1250,'2023-05-17'),
	 (3,2,1000,'2024-06-07'),
	 (1,2,7550,'2024-07-01'),
	 (1,3,7250,'2023-01-22'),
	 (2,3,2500,'2024-07-05'),
	 (4,4,59050,'2023-03-20');
INSERT INTO public.partnersproducts (productsid,partnersid,numberofproducts,saledate) VALUES
	 (3,4,37200,'2024-03-12'),
	 (5,4,4500,'2024-05-14'),
	 (3,5,50000,'2023-09-19'),
	 (4,5,670000,'2023-11-10'),
	 (1,5,35000,'2024-04-15'),
	 (2,5,25000,'2024-06-12');
INSERT INTO public.partnerstype (title) VALUES
	 ('ЗАО'),
	 ('ООО'),
	 ('ПАО'),
	 ('ОАО');
INSERT INTO public.products (article,producttype,title,description,productimage,mincostforpartner,height,width) VALUES
	 ('8758385',1,'Паркетная доска Ясень темный однополосная 14 мм','','',4456.90,NULL,NULL),
	 ('8858958',1,'Инженерная доска Дуб Французская елка однополосная 12 мм','','',7330.99,NULL,NULL),
	 ('7750282',2,'Ламинат Дуб дымчато-белый 33 класс 12 мм','','',1799.33,NULL,NULL),
	 ('7028748',2,'Ламинат Дуб серый 32 класс 8 мм с фаской','','',3890.41,NULL,NULL),
	 ('5012543',3,'Пробковое напольное клеевое покрытие 32 класс 4 мм','','',5450.59,NULL,NULL);
INSERT INTO public.productstype (title) VALUES
	 ('Паркетная доска'),
	 ('Ламинат'),
	 ('Пробковое покрытие');
